In [3]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

# csv file read and write

In [2]:
df1 = pd.read_csv('book1.csv')
df1

     Lasya  Bhaskara     Peri      Madhav
0        A         B        C           D
1  Shravan  Bhaskara  Meghana  Kothakonda
2    Apple     mango   orange      banana
3      dog       cat    panda    elephant

In [3]:
df1 = pd.read_csv('book1.csv',header=None)
df1

         0         1        2           3
0    Lasya  Bhaskara     Peri      Madhav
1        A         B        C           D
2  Shravan  Bhaskara  Meghana  Kothakonda
3    Apple     mango   orange      banana
4      dog       cat    panda    elephant

In [5]:
df2 = pd.read_csv('book1.csv',header=None,nrows=3)
df2

         0         1        2           3
0    Lasya  Bhaskara     Peri      Madhav
1        A         B        C           D
2  Shravan  Bhaskara  Meghana  Kothakonda

In [8]:
df3 = pd.read_table('book1.csv',sep=',',header=None) # generalized way
df3

         0         1        2           3
0    Lasya  Bhaskara     Peri      Madhav
1        A         B        C           D
2  Shravan  Bhaskara  Meghana  Kothakonda
3    Apple     mango   orange      banana
4      dog       cat    panda    elephant

In [9]:
df3.to_csv('book2.csv')

In [ ]:
df3.to_csv('book2.csv',columns=[0,1]) # to copy only specified number of columns

In [11]:
df3.to_csv('book2.csv',sep='_')

# json file read write

In [15]:
json_obj = """{"Name":"Lasya","surname":"Bhaskara","complexion":"Fair","husband":[{"Name":"Madhav","surname":"Peri","complexion":"Fair"}]
            }"""

In [17]:
import json

In [18]:
data = json.loads(json_obj)

In [22]:
df4 = DataFrame(data)
df4

,Name,surname,complexion,husband
0,Lasya,Bhaskara,Fair,"{'Name': 'Madhav', 'surname': 'Peri', 'complex..."

In [23]:
df4 = DataFrame(data['husband'])
df4

     Name surname complexion
0  Madhav    Peri       Fair

In [24]:
json.dumps(data) # to convert back to a json object

'{"Name": "Lasya", "surname": "Bhaskara", "complexion": "Fair", "husband": [{"Name": "Madhav", "surname": "Peri", "complexion": "Fair"}]}'

# read and write html

In [6]:
url = "http://www.fdic.gov/bank/individual/failed/banklist.html"

In [1]:
#pip3 install beautifulsoup4
#pip install html5lib

In [8]:
dflist = pd.read_html(url)
dflist

[                             Bank Name               City  ST   CERT  \
 0                    Almena State Bank             Almena  KS  15426
 1           First City Bank of Florida  Fort Walton Beach  FL  16748
 2                 The First State Bank      Barboursville  WV  14361
 3                   Ericson State Bank            Ericson  NE  18265
 4     City National Bank of New Jersey             Newark  NJ  21111
 ..                                 ...                ...  ..    ...
 558                 Superior Bank, FSB           Hinsdale  IL  32646
 559                Malta National Bank              Malta  OH   6629
 560    First Alliance Bank & Trust Co.         Manchester  NH  34264
 561  National State Bank of Metropolis         Metropolis  IL   3815
 562                   Bank of Honolulu           Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                            Equity Bank   October 23, 2020
 1              United Fidelity Bank, fsb   October 16, 2020
 2                         MVB Bank, Inc.      April 3, 2020
 3             Farmers and Merchants Bank  February 14, 2020
 4                        Industrial Bank   November 1, 2019
 ..                                   ...                ...
 558                Superior Federal, FSB      July 27, 2001
 559                    North Valley Bank        May 3, 2001
 560  Southern New Hampshire Bank & Trust   February 2, 2001
 561              Banterra Bank of Marion  December 14, 2000
 562                   Bank of the Orient   October 13, 2000

 [563 rows x 6 columns]]

In [10]:
dframe = DataFrame(dflist[0])
dframe

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

# excel file read and write

In [17]:
dfex = pd.read_excel('book1.xlsx','Sheet1',header=None)
dfex

         0         1        2           3
0    Lasya  Bhaskara     Peri      Madhav
1        A         B        C           D
2  Shravan  Bhaskara  Meghana  Kothakonda
3    Apple     mango   orange      banana
4      dog       cat    panda    elephant